# BeamHJustification Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..BeamHJustification Property
ParameterTypeId Class See Also
---
"Lateral Justification"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId BeamHJustification { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property BeamHJustification As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ BeamHJustification {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace